---
kind: method
id: M:Autodesk.Revit.DB.PerformanceAdviser.GetRuleDescription(Autodesk.Revit.DB.PerformanceAdviserRuleId)
source: html/e44f99d1-0f08-025e-7948-e9cb7ef96e43.htm
---
# Autodesk.Revit.DB.PerformanceAdviser.GetRuleDescription Method

Retrieves the description of the rule.

## Syntax (C#)
```csharp
public string GetRuleDescription(
	PerformanceAdviserRuleId id
)
```

## Parameters
- **id** (`Autodesk.Revit.DB.PerformanceAdviserRuleId`) - The rule id to get information for.

## Returns
The description of the rule.

## Exceptions
- **Autodesk.Revit.Exceptions.ArgumentNullException** - A non-optional argument was null